# GetFace Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceSilhouetteNode..::..GetFace Method
FaceSilhouetteNode Class See Also
---
Returns the Face object corresponding to the node.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public Face GetFace()
```

Visual Basic
---
```text
Public Function GetFace As Face
```

Visual C++
---
```text
public:
Face^ GetFace()
```

# ### Return Value
The face.
# See Also
FaceSilhouetteNode Class
Autodesk.Revit.DB Namespace